content/samples/diagrams/plantuml-in-md.md
```plantuml
@startuml
class TypeAdapter {
  +prepare()
  +shell()
  +bind()
}
class PlantumlAdapter {
  +bind()
}
class MermaidAdapter {
  +bind()
}
TypeAdapter <|-- PlantumlAdapter
TypeAdapter <|-- MermaidAdapter
@enduml
```
